Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D27.atdf
        <register caption="Overlay 1 Channel Disable Register" name="LCDC_OVR1CHDR" offset="0x00000144" rw="W" size="4">
          <bitfield caption="Channel Disable" mask="0x00000001" name="CHDIS"/>
          <bitfield caption="Channel Reset" mask="0x00000100" name="CHRST"/>
        </register>
        <register caption="Overlay 1 Channel Status Register" name="LCDC_OVR1CHSR" offset="0x00000148" rw="R" size="4">
          <bitfield caption="Channel Status" mask="0x00000001" name="CHSR"/>
          <bitfield caption="Update Overlay Attributes In Progress Status" mask="0x00000002" name="UPDATESR"/>
          <bitfield caption="Add To Queue Status" mask="0x00000004" name="A2QSR"/>
        </register>
        <register caption="Overlay 1 Interrupt Enable Register" name="LCDC_OVR1IER" offset="0x0000014C" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Enable" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Overlay 1 Interrupt Disable Register" name="LCDC_OVR1IDR" offset="0x00000150" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Disable" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Disable" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Disable" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Disable" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Overlay 1 Interrupt Mask Register" name="LCDC_OVR1IMR" offset="0x00000154" rw="R" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Mask" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Mask" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Mask" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Mask" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Mask" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Overlay 1 Interrupt Status Register" name="LCDC_OVR1ISR" offset="0x00000158" rw="R" size="4">
          <bitfield caption="End of DMA Transfer" mask="0x00000004" name="DMA"/>
          <bitfield caption="DMA Descriptor Loaded" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Detected" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Detected" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Overlay 1 DMA Head Register" name="LCDC_OVR1HEAD" offset="0x0000015C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFC" name="HEAD"/>
        </register>
        <register caption="Overlay 1 DMA Address Register" name="LCDC_OVR1ADDR" offset="0x00000160" rw="RW" size="4">
          <bitfield caption="DMA Transfer Overlay 1 Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Overlay 1 DMA Control Register" name="LCDC_OVR1CTRL" offset="0x00000164" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="DFETCH"/>
          <bitfield caption="Lookup Table Fetch Enable" mask="0x00000002" name="LFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="ADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONEIEN"/>
        </register>
        <register caption="Overlay 1 DMA Next Register" name="LCDC_OVR1NEXT" offset="0x00000168" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="NEXT"/>
        </register>
        <register caption="Overlay 1 Configuration Register 0" name="LCDC_OVR1CFG0" offset="0x0000016C" rw="RW" size="4">
          <bitfield caption="Source Interface" mask="0x00000001" name="SIF"/>
          <bitfield caption="AHB Burst Length" mask="0x00000030" name="BLEN" values="LCDC_OVR1CFG0__BLEN"/>
          <bitfield caption="Defined Length Burst Only for Channel Bus Transaction" mask="0x00000100" name="DLBO"/>
          <bitfield caption="Hardware Rotation Optimization Disable" mask="0x00001000" name="ROTDIS"/>
          <bitfield caption="Hardware Rotation Lock Disable" mask="0x00002000" name="LOCKDIS"/>
        </register>
        <register caption="Overlay 1 Configuration Register 1" name="LCDC_OVR1CFG1" offset="0x00000170" rw="RW" size="4">
          <bitfield caption="Color Lookup Table Mode Enable" mask="0x00000001" name="CLUTEN"/>
          <bitfield caption="RGB Mode Input Selection" mask="0x000000F0" name="RGBMODE" values="LCDC_OVR1CFG1__RGBMODE"/>
          <bitfield caption="Color Lookup Table Mode Input Selection" mask="0x00000300" name="CLUTMODE" values="LCDC_OVR1CFG1__CLUTMODE"/>
        </register>
        <register caption="Overlay 1 Configuration Register 2" name="LCDC_OVR1CFG2" offset="0x00000174" rw="RW" size="4">
          <bitfield caption="Horizontal Window Position" mask="0x000007FF" name="XPOS"/>
          <bitfield caption="Vertical Window Position" mask="0x07FF0000" name="YPOS"/>
        </register>
        <register caption="Overlay 1 Configuration Register 3" name="LCDC_OVR1CFG3" offset="0x00000178" rw="RW" size="4">
          <bitfield caption="Horizontal Window Size" mask="0x000007FF" name="XSIZE"/>
          <bitfield caption="Vertical Window Size" mask="0x07FF0000" name="YSIZE"/>
        </register>
