Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D27.atdf
        <register caption="PMECC Error Location SIGMA 17 Register" name="HSMC_SIGMA17" offset="0x56C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA17"/>
        </register>
        <register caption="PMECC Error Location SIGMA 18 Register" name="HSMC_SIGMA18" offset="0x570" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA18"/>
        </register>
        <register caption="PMECC Error Location SIGMA 19 Register" name="HSMC_SIGMA19" offset="0x574" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA19"/>
        </register>
        <register caption="PMECC Error Location SIGMA 20 Register" name="HSMC_SIGMA20" offset="0x578" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA20"/>
        </register>
        <register caption="PMECC Error Location SIGMA 21 Register" name="HSMC_SIGMA21" offset="0x57C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA21"/>
        </register>
        <register caption="PMECC Error Location SIGMA 22 Register" name="HSMC_SIGMA22" offset="0x580" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA22"/>
        </register>
        <register caption="PMECC Error Location SIGMA 23 Register" name="HSMC_SIGMA23" offset="0x584" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA23"/>
        </register>
        <register caption="PMECC Error Location SIGMA 24 Register" name="HSMC_SIGMA24" offset="0x588" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA24"/>
        </register>
        <register caption="PMECC Error Location SIGMA 25 Register" name="HSMC_SIGMA25" offset="0x58C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA25"/>
        </register>
        <register caption="PMECC Error Location SIGMA 26 Register" name="HSMC_SIGMA26" offset="0x590" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA26"/>
        </register>
        <register caption="PMECC Error Location SIGMA 27 Register" name="HSMC_SIGMA27" offset="0x594" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA27"/>
        </register>
        <register caption="PMECC Error Location SIGMA 28 Register" name="HSMC_SIGMA28" offset="0x598" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA28"/>
        </register>
        <register caption="PMECC Error Location SIGMA 29 Register" name="HSMC_SIGMA29" offset="0x59C" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA29"/>
        </register>
        <register caption="PMECC Error Location SIGMA 30 Register" name="HSMC_SIGMA30" offset="0x5A0" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA30"/>
        </register>
        <register caption="PMECC Error Location SIGMA 31 Register" name="HSMC_SIGMA31" offset="0x5A4" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA31"/>
        </register>
        <register caption="PMECC Error Location SIGMA 32 Register" name="HSMC_SIGMA32" offset="0x5A8" rw="RW" size="4">
          <bitfield caption="Coefficient of degree x in the SIGMA polynomial" mask="0x00003FFF" name="SIGMA32"/>
        </register>
        <register caption="PMECC Error Location 0 Register" count="32" name="HSMC_ERRLOC" offset="0x5AC" rw="R" size="4">
          <bitfield caption="Error Position within the Set {sector area, spare area}" mask="0x00003FFF" name="ERRLOCN"/>
        </register>
        <register-group count="4" name="SMC_CS_NUMBER" name-in-module="SMC_CS_NUMBER" offset="0x700" size="20"/>
        <register caption="Off Chip Memory Scrambling Register" name="HSMC_OCMS" offset="0x7A0" rw="RW" size="4">
          <bitfield caption="Static Memory Controller Scrambling Enable" mask="0x00000001" name="SMSE"/>
          <bitfield caption="NFC Internal SRAM Scrambling Enable" mask="0x00000002" name="SRSE"/>
        </register>
        <register caption="Off Chip Memory Scrambling KEY1 Register" name="HSMC_KEY1" offset="0x7A4" rw="W" size="4">
          <bitfield caption="Off Chip Memory Scrambling (OCMS) Key Part 1" mask="0xFFFFFFFF" name="KEY1"/>
        </register>
        <register caption="Off Chip Memory Scrambling KEY2 Register" name="HSMC_KEY2" offset="0x7A8" rw="W" size="4">
          <bitfield caption="Off Chip Memory Scrambling (OCMS) Key Part 2" mask="0xFFFFFFFF" name="KEY2"/>
        </register>
        <register caption="Write Protection Mode Register" name="HSMC_WPMR" offset="0x7E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="HSMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="HSMC_WPSR" offset="0x7E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="Selection of the Control Signal for Read Operation" name="HSMC_MODE0__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
