Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D27.atdf
        <register caption="UDPHS Endpoint Control Enable Register (endpoint = 0)" name="UDPHS_EPTCTLENB" offset="0x4" rw="W" size="4">
          <mode name="DEFAULT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x0 0x2 0x3"/>
          <mode name="ISOENDPT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x1"/>
          <bitfield caption="Endpoint Enable" mask="0x00000001" modes="DEFAULT" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enable" mask="0x00000002" modes="DEFAULT" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" modes="DEFAULT" name="INTDIS_DMA"/>
          <bitfield caption="NYET Disable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" modes="DEFAULT" name="NYET_DIS"/>
          <bitfield caption="Overflow Error Interrupt Enable" mask="0x00000100" modes="DEFAULT" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000200" modes="DEFAULT" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enable" mask="0x00000400" modes="DEFAULT" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready Interrupt Enable" mask="0x00000800" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Received SETUP" mask="0x00001000" modes="DEFAULT" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Interrupt Enable" mask="0x00002000" modes="DEFAULT" name="STALL_SNT"/>
          <bitfield caption="NAKIN Interrupt Enable" mask="0x00004000" modes="DEFAULT" name="NAK_IN"/>
          <bitfield caption="NAKOUT Interrupt Enable" mask="0x00008000" modes="DEFAULT" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Enable" mask="0x00040000" modes="DEFAULT" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Send/Short Packet Interrupt Enable" mask="0x80000000" modes="DEFAULT" name="SHRT_PCKT"/>
          <bitfield caption="Endpoint Enable" mask="0x00000001" modes="ISOENDPT" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enable" mask="0x00000002" modes="ISOENDPT" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" modes="ISOENDPT" name="INTDIS_DMA"/>
          <bitfield caption="DATAx Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints)" mask="0x00000040" modes="ISOENDPT" name="DATAX_RX"/>
          <bitfield caption="MDATA Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints)" mask="0x00000080" modes="ISOENDPT" name="MDATA_RX"/>
          <bitfield caption="Overflow Error Interrupt Enable" mask="0x00000100" modes="ISOENDPT" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000200" modes="ISOENDPT" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enable" mask="0x00000400" modes="ISOENDPT" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Enable" mask="0x00000800" modes="ISOENDPT" name="TXRDY_TRER"/>
          <bitfield caption="Error Flow Interrupt Enable" mask="0x00001000" modes="ISOENDPT" name="ERR_FL_ISO"/>
          <bitfield caption="ISO CRC Error/Number of Transaction Error Interrupt Enable" mask="0x00002000" modes="ISOENDPT" name="ERR_CRC_NTR"/>
          <bitfield caption="Bank Flush Error Interrupt Enable" mask="0x00004000" modes="ISOENDPT" name="ERR_FLUSH"/>
          <bitfield caption="Busy Bank Interrupt Enable" mask="0x00040000" modes="ISOENDPT" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Send/Short Packet Interrupt Enable" mask="0x80000000" modes="ISOENDPT" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Control Disable Register (endpoint = 0)" name="UDPHS_EPTCTLDIS" offset="0x8" rw="W" size="4">
          <mode name="DEFAULT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x0 0x2 0x3"/>
          <mode name="ISOENDPT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x1"/>
          <bitfield caption="Endpoint Disable" mask="0x00000001" modes="DEFAULT" name="EPT_DISABL"/>
          <bitfield caption="Packet Auto-Valid Disable" mask="0x00000002" modes="DEFAULT" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" modes="DEFAULT" name="INTDIS_DMA"/>
          <bitfield caption="NYET Enable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" modes="DEFAULT" name="NYET_DIS"/>
          <bitfield caption="Overflow Error Interrupt Disable" mask="0x00000100" modes="DEFAULT" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Disable" mask="0x00000200" modes="DEFAULT" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Disable" mask="0x00000400" modes="DEFAULT" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready Interrupt Disable" mask="0x00000800" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Received SETUP Interrupt Disable" mask="0x00001000" modes="DEFAULT" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Interrupt Disable" mask="0x00002000" modes="DEFAULT" name="STALL_SNT"/>
          <bitfield caption="NAKIN Interrupt Disable" mask="0x00004000" modes="DEFAULT" name="NAK_IN"/>
          <bitfield caption="NAKOUT Interrupt Disable" mask="0x00008000" modes="DEFAULT" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Disable" mask="0x00040000" modes="DEFAULT" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x80000000" modes="DEFAULT" name="SHRT_PCKT"/>
          <bitfield caption="Endpoint Disable" mask="0x00000001" modes="ISOENDPT" name="EPT_DISABL"/>
          <bitfield caption="Packet Auto-Valid Disable" mask="0x00000002" modes="ISOENDPT" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" modes="ISOENDPT" name="INTDIS_DMA"/>
          <bitfield caption="DATAx Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints)" mask="0x00000040" modes="ISOENDPT" name="DATAX_RX"/>
          <bitfield caption="MDATA Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints)" mask="0x00000080" modes="ISOENDPT" name="MDATA_RX"/>
          <bitfield caption="Overflow Error Interrupt Disable" mask="0x00000100" modes="ISOENDPT" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Disable" mask="0x00000200" modes="ISOENDPT" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Disable" mask="0x00000400" modes="ISOENDPT" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Disable" mask="0x00000800" modes="ISOENDPT" name="TXRDY_TRER"/>
          <bitfield caption="Error Flow Interrupt Disable" mask="0x00001000" modes="ISOENDPT" name="ERR_FL_ISO"/>
          <bitfield caption="ISO CRC Error/Number of Transaction Error Interrupt Disable" mask="0x00002000" modes="ISOENDPT" name="ERR_CRC_NTR"/>
          <bitfield caption="bank flush error Interrupt Disable" mask="0x00004000" modes="ISOENDPT" name="ERR_FLUSH"/>
          <bitfield caption="Busy Bank Interrupt Disable" mask="0x00040000" modes="ISOENDPT" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x80000000" modes="ISOENDPT" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Control Register (endpoint = 0)" name="UDPHS_EPTCTL" offset="0xC" rw="R" size="4">
          <mode name="DEFAULT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x0 0x2 0x3"/>
          <mode name="ISOENDPT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x1"/>
          <bitfield caption="Endpoint Enable (cleared upon USB reset)" mask="0x00000001" modes="DEFAULT" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enabled (Not for CONTROL Endpoints) (cleared upon USB reset)" mask="0x00000002" modes="DEFAULT" name="AUTO_VALID"/>
          <bitfield caption="Interrupt Disables DMA (cleared upon USB reset)" mask="0x00000008" modes="DEFAULT" name="INTDIS_DMA"/>
          <bitfield caption="NYET Disable (Only for High Speed Bulk OUT Endpoints) (cleared upon USB reset)" mask="0x00000010" modes="DEFAULT" name="NYET_DIS"/>
          <bitfield caption="Overflow Error Interrupt Enabled (cleared upon USB reset)" mask="0x00000100" modes="DEFAULT" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enabled (cleared upon USB reset)" mask="0x00000200" modes="DEFAULT" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enabled (cleared upon USB reset)" mask="0x00000400" modes="DEFAULT" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready Interrupt Enabled (cleared upon USB reset)" mask="0x00000800" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Received SETUP Interrupt Enabled (cleared upon USB reset)" mask="0x00001000" modes="DEFAULT" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Interrupt Enabled (cleared upon USB reset)" mask="0x00002000" modes="DEFAULT" name="STALL_SNT"/>
          <bitfield caption="NAKIN Interrupt Enabled (cleared upon USB reset)" mask="0x00004000" modes="DEFAULT" name="NAK_IN"/>
          <bitfield caption="NAKOUT Interrupt Enabled (cleared upon USB reset)" mask="0x00008000" modes="DEFAULT" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Enabled (cleared upon USB reset)" mask="0x00040000" modes="DEFAULT" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Enabled (cleared upon USB reset)" mask="0x80000000" modes="DEFAULT" name="SHRT_PCKT"/>
          <bitfield caption="Endpoint Enable (cleared upon USB reset)" mask="0x00000001" modes="ISOENDPT" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enabled (cleared upon USB reset)" mask="0x00000002" modes="ISOENDPT" name="AUTO_VALID"/>
          <bitfield caption="Interrupt Disables DMA (cleared upon USB reset)" mask="0x00000008" modes="ISOENDPT" name="INTDIS_DMA"/>
          <bitfield caption="DATAx Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints) (cleared upon USB reset)" mask="0x00000040" modes="ISOENDPT" name="DATAX_RX"/>
          <bitfield caption="MDATA Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints) (cleared upon USB reset)" mask="0x00000080" modes="ISOENDPT" name="MDATA_RX"/>
          <bitfield caption="Overflow Error Interrupt Enabled (cleared upon USB reset)" mask="0x00000100" modes="ISOENDPT" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enabled (cleared upon USB reset)" mask="0x00000200" modes="ISOENDPT" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enabled (cleared upon USB reset)" mask="0x00000400" modes="ISOENDPT" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Enabled (cleared upon USB reset)" mask="0x00000800" modes="ISOENDPT" name="TXRDY_TRER"/>
          <bitfield caption="Error Flow Interrupt Enabled (cleared upon USB reset)" mask="0x00001000" modes="ISOENDPT" name="ERR_FL_ISO"/>
          <bitfield caption="ISO CRC Error/Number of Transaction Error Interrupt Enabled (cleared upon USB reset)" mask="0x00002000" modes="ISOENDPT" name="ERR_CRC_NTR"/>
          <bitfield caption="Bank Flush Error Interrupt Enabled (cleared upon USB reset)" mask="0x00004000" modes="ISOENDPT" name="ERR_FLUSH"/>
          <bitfield caption="Busy Bank Interrupt Enabled (cleared upon USB reset)" mask="0x00040000" modes="ISOENDPT" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Enabled (cleared upon USB reset)" mask="0x80000000" modes="ISOENDPT" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Set Status Register (endpoint = 0)" name="UDPHS_EPTSETSTA" offset="0x14" rw="W" size="4">
          <mode name="DEFAULT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x0 0x2 0x3"/>
          <mode name="ISOENDPT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x1"/>
          <bitfield caption="Stall Handshake Request Set" mask="0x00000020" modes="DEFAULT" name="FRCESTALL"/>
          <bitfield caption="KILL Bank Set (for IN Endpoint)" mask="0x00000200" modes="DEFAULT" name="RXRDY_TXKL"/>
          <bitfield caption="TX Packet Ready Set" mask="0x00000800" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="KILL Bank Set (for IN Endpoint)" mask="0x00000200" modes="ISOENDPT" name="RXRDY_TXKL"/>
          <bitfield caption="TX Packet Ready Set" mask="0x00000800" modes="ISOENDPT" name="TXRDY_TRER"/>
        </register>
